package com.geniusnine.android.marathijokes.Best;

import android.content.Intent;
import android.os.Bundle;
import android.support.v4.view.PagerAdapter;
import android.support.v4.view.ViewPager;
import android.support.v7.app.AppCompatActivity;
import android.view.MenuItem;

import com.geniusnine.android.marathijokes.R;


public class BestJoke extends AppCompatActivity {

    String[] List;

    ViewPager viewPager;
    PagerAdapter adapter;
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_best_joke);

        List = new String[] {"नवरा - तुझी बहीण तुझ्या मानाने किती सुंदर आहे.\n" +
                "\n" +
                "बायको - मग तिच्याशीच करायचे होते लग्न. मला कशाला गटवलीत?\n" +
                "\n" +
                "नवरा - तीच म्हणाली ताईचे झाल्याशिवाय मी नाही जा " ,

                        "बायकोच्या सततच्या बडबडीमुळे चंदू जाम वैतागला होता.\n" +
                                "\n" +
                                "चंदू : तू जर पाच मिनिटं गप्प बसलीस ना तर मी तुला पाचशे रुपये देईन.\n" +
                                "\n" +
                                "चंदूची बायको गप्प बसली. जेमतेम दोन मिनिटांनंतर तिने चंदूला विचारलं, 'अहो, जरा घड्याळ बघा ना, पाच मिनिटं झाली का ते?'","बायको : काय हो...इतक्या हळू आवाजात कोणाशी बोलताय?\n" +
                "\n" +
                "नवरा : बहिणीशी\n" +
                "\n" +
                "बायको : अहो मग, बहिणीशी इतक्या हळू आवाजात कशाला बोलायला हवं?\n" +
                "\n" +
                "नवरा : अगं माझ्या नाही, तुझ्या बहिणीशी बोलतोय.","शिरप्याचं गाढव हरवलं. तरीही तो देवाला धन्यवाद देऊ लागला.\n" +
                "\n" +
                "गणा : काय रं शिरप्या, तुझं गाढव हरवलं आनि तरी बी तू देवाचे आभार मानतुयंस?\n" +
                "\n" +
                "शिरप्या : आरं बाबा, देवाचीच किरपा की मी त्या गाढवावर बसलो नव्हतो, न्हाय तर मी बी हरवलो असतो की.",
                "पती : तू आणि फक्त तूच या घराला स्वर्ग बनवू शकतेस?\n" +
                        "\n" +
                        "पत्नी : कसं काय?\n" +
                        "\n" +
                        "पती : माहेरी जाऊन!!","न्यूटनचा मृत्यू कसा झाला???\n" +
                ".\n" +
                ".\n" +
                ".\n" +
                ".\n" +
                ".\n" +
                "त्याने रजनीकांतचे पिक्चर बघितले आणि आपण स्वत: तयार केलेल्या नियमांची वाट लागताना बघून त्याला धक्का बसला ","गर्लफ्रेण्ड : आपण कुठे चाललोय?\n" +
                "\n" +
                "बॉयफ्रेण्ड : लाँग ड्राइव्हवर!\n" +
                "\n" +
                "गर्लफ्रेण्ड : (लाडात येऊन) मग आधी का नाही सांगितलंस?\n" +
                "\n" +
                "बॉयफ्रेण्ड : मला पण आत्ताच कळलं की, ब्रेक फेल झालेत!!","एकदा टाटा मोटर्स चे काही अधिकारी \"नॅनो\" बद्दलचा प्रतिसाद पाहण्यासाठी पुण्यात सर्व्हे घेत असतात. फिरत फिरत ते सदाशिव पेठेत तात्यांच्या घरी येतात.\n" +
                "\n" +
                "अधिकारी : नमस्कार ! आमच्या \"नॅनो\" बाबतीत आपले काय मत आहे ?\n" +
                "तात्या : मला तुमच्या ह्या \"न्यानो\" गाडीचं नाव अगदी सार्थ वाटतं..\n" +
                "अधिकारी : का बरं ?\n" +
                "...तात्या : तुमचे सेल्समन म्हणतात \" न्या \".. आणि आम्ही म्हणतो \" नो \" !","मन्या पाटील लंगडत लंगडत शाळेत ऊशीरा पोचला.\n" +
                "इंग्रजीचे सर ओरडले.\"व्हाय आर यू लेट?\"\n" +
                "इंग्रजीत सुमार मन्या म्हणाला, \"सर रस्त्यावर चिख्खल झाला होता आणि तिथे उभ्या बैलाने ढुशी मारली. माझा पाय मोडला. म्हणून ऊशीर झाला.\"\n" +
                "सर पुन्हा ओरडले, \"टॉक इन इंग्लिश!\"...\n" +
                "हजरजबाबी मन्याने म्हटले,\"सर देयर वॉज चिखलीपिकेशन ऑन रोड. काऊज हसबण्ड केम. ह...ी मारिंग मी शींगडा मेड मी लंगडा. सो आय कम लेट!\"","गण्या : अरे मित्रा \" अरेंज मॅरेज \" म्हणजे काय ?\n" +
                "\n" +
                "बंड्या : सोप्प आहे रे , समज... तू रस्त्यावरून चालला आहेस आणी अचानक तुला नागीण चावते ..\n" +
                "\n" +
                "गण्या : ठीक आहे ...आणी \" लव मॅरेज \" म्हणजे काय ?\n" +
                "...\n" +
                "बंड्या : लव मॅरेज \" म्हणजे तू त्या नागीण कडे जातो आणी तीला बोलतो \" फूस फूस ... चाव ना मला ..चाव ..\"","इंग्लिश मॉम म्हणते गुड नाइट\n" +
                "\n" +
                "हिंदी मा म्हणते शुभ रात्री\n" +
                "\n" +
                "मुस्लीम मा म्हणते शब्बा खैर\n" +
                "...\n" +
                "आणि आपली मराठमोळी आई म्हणते, अरे आग लाव त्या मोबाईलला आणि झोप आता.. ","पक्क्याच बायकोबरोबर भांडण चाललं होते....\n" +
                "\n" +
                "बायको (वैतागून) : तुमच्या डोक्यात ना नुसतं शेण भरलय......\n" +
                "\n" +
                "पक्क्या : अच्छा, आता मला कळले की तू इतका वेळ माझे डोके का खाते आहेस ते...","मंग्या कानात बाळी घालून फिरत होता,\n" +
                "चंद्या : कानात बाळी? हि नवीन फॅशन तू कधी पासून सुरू केलीस?\n" +
                "मंग्या : अरे बायको माहेरी जाऊन आल्यापासून..\n" +
                "चंद्या : म्हणजे वहीनीनी माहेरून तुझ्यासाठी बाळी आणली की काय ?\n" +
                "मंग्या : नाही रे गाढवा !!! ही बाळी तिला माझ्या अंथरुणात सापडली, आता माझीच आहे सांगितलं म्हणून झक मारत घालावी लागतेय..","मुलगा : बाबा 1 ग्लास पाणी द्या ना ?\n" +
                "बाप : स्वतः उठुन घे...?\n" +
                "मुलगा : प्लीज द्या ना बाबा..\n" +
                "बाप : आता थोबाडित मारीन तुझ्या!\n" +
                "मुलगा : थोबाडीत मारायला याल तेव्हा येताना पाणी आणा.","बहिण : मुलगा कसा आहे?\n" +
                "भाऊ : मुलगा चांगला आहे, engineer आहे, दिसायला फिल्मचा हिरो वाटतो...\n" +
                "बहिण : कुठल्या फिल्मचा हिरो?\n" +
                "भाऊ : \"पा\".","नवरा : तू मला आत्ता कुत्रा म्हणालीस?\n" +
                "\n" +
                "बायको लक्षच देत नाही,\n" +
                "\n" +
                "नवरा पुन्हा विचारतो.\n" +
                "...\n" +
                "काहीच उत्तर नाही.\n" +
                "\n" +
                "तो पुन्हा विचारतो.\n" +
                "\n" +
                "बायको : नाही म्हणाले पण आता भुंकणे थांबवा जरा!!","बाप : या वेळी नापास झालास तर यापुढे मला 'बाबा' म्हणून हाक मारू नकोस चंद्या.\n" +
                "सालाबादाप्रमाणे याही वर्षी आपला चंद्या नापास झाला,\n" +
                "बाप : काय लागला निकाल?\n" +
                "चंद्या : माफ कर रे रम्या, तुला बाबा म्हणून हाक मारण माझ्या नशिबात नाहीये बहुतेक...","आजोबा : पिंट्या लप, तुला शोधत तुझी टीचर आली आहे.\n" +
                "पिंट्या : आजोबा तुम्हिच लपा.\n" +
                "आजोबा : का रे.. ???\n" +
                "पिंट्या : अहो आजोबा, तुम्ही मेलात म्हणुन आठ दिवस सूटी घेतली आहे मी...","Bf: मला  तुझे  \"दात\" खूप  आवडतात ...\n" +
                "GF: अय्यां...खरच ..का  रे ??\n" +
                "BF: कारण  \"yellow \" माझा  फेवरीट कलर आहे","स्थळ-सदाशिव पेठेतील हॉटेल.\n" +
                "गृहस्थ-मी इथले स्वच्छतागृह वापरू शकतो का?\n" +
                ".\n" +
                "व्यवस्थापक-पैसे पडतील.\n" +
                ".\n" +
                "गृहस्थ-नाही! तेवढी काळजी घेईन मी...","पत्नी : तू तुझ्या मित्रांना असं का सांगितलंस की, मी खूप चांगला स्वयंपाक\n" +
                "करते?\n" +
                "\n" +
                "पती : तुझ्याशी लग्न करण्याचं काही तरी कारण त्यांना सांगायला हवं होतं ना!"
        };






        getSupportActionBar().setDisplayHomeAsUpEnabled(true);



        viewPager = (ViewPager) findViewById(R.id.Pager);
        // Pass results to ViewPagerAdapter Class
        adapter = new ViewPagerAdapter(BestJoke.this,List);
        // Binds the Adapter to the ViewPager
        viewPager.setAdapter(adapter);

        int pos = getIntent().getIntExtra("key", 0);
        viewPager.setCurrentItem(pos);



    }






    @Override
    public boolean onOptionsItemSelected(MenuItem item) {
        // Handle action bar item clicks here. The action bar will
        // automatically handle clicks on the Home/Up button, so long
        // as you specify a parent activity in AndroidManifest.xml.
        int id = item.getItemId();

        //noinspection SimplifiableIfStatement

        switch (item.getItemId()) {
            case android.R.id.home:

                // app icon in action bar clicked; goto parent activity.
                this.finish();
                return true;
            default:
                if (id == R.id.action_send) {
                    Intent i = new Intent(Intent.ACTION_SEND);
                    i.setType("text/plain");
                    i.putExtra(Intent.EXTRA_TEXT, "message to share");
                    startActivity(Intent.createChooser(i, "Share via"));
                    return true;
                }
                return super.onOptionsItemSelected(item);

        }
    }
}
