package com.geniusnine.android.marathijokes.Puneri;

/**
 * Created by Dev on 14-12-2016.
 */


import android.content.Intent;
import android.os.Bundle;
import android.support.v7.app.AppCompatActivity;
import android.view.MenuItem;
import android.view.View;
import android.widget.AdapterView;
import android.widget.ArrayAdapter;
import android.widget.ListView;

import com.geniusnine.android.marathijokes.R;

;


/**
 * Created by Dev on 13-12-2016.
 */

public class Puneri extends AppCompatActivity {
    ListView listView;
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_best);
        listView=(ListView)findViewById(R.id.listView);

        String[] values = new String[] {"पुणेरी : ओ दुकानदार, केळी कशी दिली राव?\n" +
                "दुकानदार : एक रुपयाला एक" ,"एक बाळ जन्माला आल्या-आल्या बोलायला लागतो,\n" +
                "तो nurse ला विचारतो, खायला काय आहे?\n" +
                "nurse : पोहे आणि उपीट तयार आहे...\n" +
                "मुलगा: चायला! परत पुण्यात जन्माला आलो....!!","पुणेरी boyfriend -\n" +
                "मुलगा: I'll climb the tallest mountain, swim the deepest sea, walk\n" +
                "on fire just for you.","एक पुणेरी मुलगा आपल्या मित्रांना घरी घेऊन आला आणि म्हणाला, \" थांबा मी चहा घेऊन आलो...\"\n" +
                "१० मिनीटांनी, \" चला माझा चहा घेऊन झाला आपण आता जाऊया...!\""," स्थळ : सदाशिव पेठ, पुणे.\n" +
                ".......\n" +
                "जोशीकाका : काय तात्या, आज अगदी आनंदात दिसता आहात ! काय झालं ?\n" +
                "तात्या : अहो, आमच्या शेजारच्या कुलकर्ण्यांना १ लाख रुपयाची लॉटरी लागलीये!"," स्थळ: (पुण्याशिवाय दुसरे असू शकत नाही.)\n" +
                "पेशंट:- डॉक्टर, प्लास्टिक सर्जरी करायची आहे, साधारण किती खर्च येईल?\n" +
                "डॉक्टर:- ३ लाख रुपये.","स्वारगेट वर मुंबईची मुलगी आपल्या कॉलेज स्टाईल मध्ये तुच्छतेने कंन्डक्टरला विचारते : हे डबडं केव्हा हलणार इथून?\n" +
                "कंन्डक्टर (अदबीने, सस्मित) : कचरा भरल्यानंतर लगेचच !\n" +
                "तात्पर्य : महामंडळाच्या कंन्डक्टरचा नाद करू नये","पुणेकर : काका पावशेर रताळे द्या\n" +
                "दुकानदार : पिशवीत देऊ?\n" +
                "पुणेकर : नाही नाही… पेन ड्राईव्ह आणलाय. त्यात “रताळे” नावाचा फोल्डर बनवा आणि टाका त्यात","पुणेकर : काय हो गहू कसा आणला?\n" +
                "कोल्हापूरकर : पिशवीतून आणला\n" +
                "पुणेकर : कितीला आणला?","तुम्हाला माहीत आहे का, सदाशिव पेठेत एकही जिम नाही. याचे कारण काय?\n" +
                "जिमला जाणे म्हणजे घरचं खायचं आणि लोकांचं लोखंड उचलायचं आणि वर त्यांनाच पैसे द्यायचे…\n" +
                "छे छे असा वेडेपणा कोण करणार?","पुणेरी लाडूची रेसीपी :\n" +
                "लाडू करताना लाडूला काजू फक्त टोचावा आणि पुन्हा काढावा.\n" +
                "खाणाऱ्याला वाटेल कि नेमका आपल्याच लाडूचा काजू गळून पडला असेल.\n" +
                "अशा प्रकारे एक काजू सर्व लाडूंना पुरून उर","एक आजोबा कोथरूडला रिक्ष्यात बसतात. शिवाजी पुतळ्याला रिक्षा थांबवतात.\n" +
                "आजोबा : किती झाले?\n" +
                "रिक्षावाला : ३२ रुपये\n" +
                "आजोबा ४० रुपये देतात","पुणेरी माणूस : केळी कशी दिली राव?\n" +
                "दुकानदार : एक रुपयाला एक\n" +
                "पुणेरी माणूस : काय तरी काय. साठ पैशाला देता का बोला","कोलगेट : काय आपल्या टूथ पेस्ट मध्ये मीठ आहे ?\n" +
                "पुणेकर : नाही, आम्ही वरून टाकून घेतो चवीनुसार" +
                "कोलगेट वाल्याने स्वत:च्या थोबाडीत मारून घेतल्या","मासेवाला : साहेब खेकडे घ्या एकदम ताजे आहेत\n" +
                "पुणेरी ग्राहक : द्या मग १०० रुपयाचे\n" +
                "मासेवाला : कशात नेता?? पिशवी देऊ का ??\n" +
                "पुणेरी ग्राहक (रागाने) : नाही काठी दे, हाकत हाकत नेतो घरापर्यंत","स्थळ : अर्थातच पुणे…\n" +
                "कंडक्टर : सुट्टे पैसे नसणाऱ्यांनी खाली उतरा\n" +
                "कुलकर्णी १०० रुपये कंडक्टरला देऊन म्हणतात, “डेक्कन पर्यंत एक फुल द्या”\n" +
                "कंडक्टर : (वैतागून) आहो तिकीट ६ रुपये आहे. तुम्हाला परत द्यायला माझ्याकडे ९४ रुपये सुटते नाहीत.\n" +
                "कुलकर्णी : मग खाली उतरा","पुण्यात एकदा एका कॅन्टीन मध्ये दोन मुली स्कार्फ बांधून गप्पा मारत होत्या.\n" +
                "जवळजवळ अर्धा तास गप्पा मारत होत्या.\n" +
                "काही वेळाने दोघींनी स्कार्फ काढला आणि अचानक ओरडल्या, “अय्या तू कोण???”","पुण्यातील एक नामवंत डॉक्टर : तुमच्या आजाराचं नेमकं कारण माझ्या लक्षात येत नाहीये. कदाचित दारू प्यायल्यामुळे हे होत असावं…\n" +
                "पुणेरी पेशंट : हरकत नाही… तुमची उतरल्यानंतर येतो मी परत","पुण्यातील एक खवचट म्हातारा एकदा दातांच्या डॉक्टरांकडे गेला. त्या खुर्चीत बसल्यावर डॉक्टरांनी त्यांना मोठा आ आ आ करायला सांगितले. कितीही मोठा केला तरी ते आजून मोठा करायला सांगायचे.\n" +
                "म्हातारा म्हणाला, “तोंडात बसून काढणार असाल तर ती पायातली चप्पल आधी काढा”","जोशी काकू : बघा, मंडईतून भाजी आणण्यापासून ओलिंपिक मेडल पर्यन्त सगळं बायकांनाच आणावं लागतंय\n" +
                "जोशी काका : आम्ही पुरुष मेडल बीड्ल्सच्या भानगडीत पडत नाहीत कारण कोणतंही मेडल आणले तरी बायको नाक मुरडणारच आणि ते बदलून आणायला पाठवणार…. अगदी गोल्ड मेडल जरी आणले तरी बायकोला डिझाईन पसंत पडेलच याची काय गॅरंटी?"
        ,"फोनची बेल वाजते. (तो चुकीचा क्रमांक लागलेला असतो.)\n" +
                "पहिला(फोन करणारा पुणेरी) : हेलौ..\n" +
                "दुसरा : बोला.\n" +
                "पहिला : देशपांडे आहेत का ?\n" +
                "दुसरा(चिडून) : नाही, ते 'पावन खिंडीत' लढतायेत!\n" +
                "पहिला : मग त्यांना सांगा राजे गडावर पोचले. आता मेलात तरी चालेल.","एक वयस्कर (स्वभावाने पुणेकर) एका बँकेचा चेक घेऊन दुसऱ्या बँकेत भरायला गेले. " +
                "'चेक कॅश व्हायला दोन दिवस लागतील, मध्ये एक सुट्टी आहे' हे काही त्यांच्या पचनी पडलं नाही. समोरच बँक असल्याने झटपट व्हायला पाहिजे हा हेका आणि तरीही 'प्रोसिजर' " +
                "असते हे समजावण्याचा बँकेतील कारकूनाचा प्रयत्न अशी जुगलबंदी रंगली. शेवटी बँकेच्या इरसाल कारकूनाने 'पुणे-अस्त्र'च काढलं.","एका वाड्यात एक नवे जोडपे आले, जोशी काका ऑफिस ला निघताना जोशी काकू रोज म्हणायच्या -\" काहो ! पेरू चा पापा घेतला ना ?\n" +
                "पहिले वाड्यातला बायका हसायला लागल्या,मग चिडायला लागल्या.\n" +
                "एक दिवस त्यांनी वैतागून काकू ला म्हटले -\" अहो एवढा रसिकपणा ठीक नाही, आमच्या मुला आणि नवर्यांवर वाईट प्रभाव पडतो, ते सुद्धा आता फाजीलपणा करायला लागले आहे. हे सर्व बंद करा आता.\n" +
                "काकू: मी काय रसिकपणा केला ?\n" +
                "वाड्यातला बायका: अहो \" पेरू चा पापा घेतला ना \" याचा अर्थ काय तो आम्हाला काय समझत नाही का?\n" };

        getSupportActionBar().setDisplayHomeAsUpEnabled(true);


        ArrayAdapter<String> adapter = new ArrayAdapter<String>(this,
                android.R.layout.simple_list_item_1, android.R.id.text1, values);

        // Assign adapter to ListView
        listView.setAdapter(adapter);

        listView.setOnItemClickListener(new AdapterView.OnItemClickListener() {
            @Override
            public void onItemClick(AdapterView<?> parent, View view, int position, long id) {
                Intent i = new Intent(Puneri.this,PuneriJokes.class);
                i.putExtra("key", position);
                startActivity(i);


            }
        });

    }







    @Override
    public boolean onOptionsItemSelected(MenuItem item) {
        // Handle action bar item clicks here. The action bar will
        // automatically handle clicks on the Home/Up button, so long
        // as you specify a parent activity in AndroidManifest.xml.
        int id = item.getItemId();

        //noinspection SimplifiableIfStatement

        switch (item.getItemId()) {
            case android.R.id.home:

                // app icon in action bar clicked; goto parent activity.
                this.finish();
                return true;
            default:
                if (id == R.id.action_send) {
                    Intent i = new Intent(Intent.ACTION_SEND);
                    i.setType("text/plain");
                    i.putExtra(Intent.EXTRA_TEXT, "message to share");
                    startActivity(Intent.createChooser(i, "Share via"));
                    return true;
                }
                return super.onOptionsItemSelected(item);

        }
    }
}


