package com.geniusnine.android.marathijokes.Sardar;

/**
 * Created by Dev on 14-12-2016.
 */


import android.content.Intent;
import android.os.Bundle;
import android.support.v4.view.PagerAdapter;
import android.support.v4.view.ViewPager;
import android.support.v7.app.AppCompatActivity;
import android.view.MenuItem;

import com.geniusnine.android.marathijokes.Best.ViewPagerAdapter;
import com.geniusnine.android.marathijokes.R;


public class SardarJokes extends AppCompatActivity {

    String[] List;

    ViewPager viewPager;
    PagerAdapter adapter;
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_best_joke);

        List = new String[] {"एका सरदारजीने आपल्या गर्ल फ्रेंडला फोन केला, '' डार्लींग आज संध्याकाळी 6 वाजता माझ्या घरी ये... आज घरी कुणीच नाही आहे. ''\n" +
                "\n" +
                "\n" +
                "आपल्या बॉय फ्रेंड च्या म्हणण्यानूसार सरदारजीची गर्लफ्रेंड बरोबर संध्याकाळी 6 वाजता सरदारजीच्या घरी पोहोचली आणि एक तासभर घरात इकडे तिकडे शोधत राहाली कारण खरच घरी कुणी नव्हतं... सरदारजीसुध्दा. "

,"प्रश्न - जर एक सरदार चंद्रावर गेला तर त्याला काय म्हणाल ?\n" +
                "\n" +
                "उत्तर - प्रॉब्लेम\n" +
                "\n" +
                "प्रश्न - जर दहा सरदार चंद्रावर गेले तर त्याला काय म्हणाल ?\n" +
                "\n" +
                "उत्तर - प्रॉब्लेम्स\n" +
                "\n" +
                "प्रश्न - आणि जर जगातील सगळे सरदार चंद्रावर गेले तर त्याला काय म्हणाल ?\n" +
                "\n" +
                "उत्तर - प्रॉब्लेम सॉल्वड्"
,"प्रश्न - सरदारचे डोळे कसे चमकवाल?\n" +
                "\n" +
                "उत्तर - त्याच्या कानात टॉर्चचा उजेड टाकून....","जाहिरातीमुळे काही समस्या फार लवकर सोडविल्या जावू शकतात...\n" +
                "\n" +
                "\n" +
                "\n" +
                "एका सरदारजीने कुठेतरी वाचले आणि पेपरमध्ये नाईट वॉचमनसाठी जाहिरात दिली...\n" +
                "\n" +
                "\n" +
                "त्याच रात्री त्याच्या घरी चोरी झाली.\n","\n" +
                "एका सरदाराने गुरुद्वाराच्या बाहेर काढून ठेवलेली चप्पल चोरी जावू नए म्हणून एक बढिया शक्कल लढवली...\n" +
                "\n" +
                "\n" +
                "-\n" +
                "\n" +
                "-\n" +
                "\n" +
                "दोन्ही चप्पल ला कुलूप लाऊन बाहेरच ठेवला ","एका टीव्हीवर सुरु असलेल्या कॉमेडी प्रोग्रॅममध्ये भाग घेतलेल्या एका सरदारजीला त्याच्या प्रेझेन्स ऑफ माईंडवर खुप गर्व होता. प्रोग्रॅमच्या जजने त्याचा गर्व तोडण्याचे ठरविले आणि त्याला पहीला प्रश्न विचारला,\n" +
                " '' सरदारजी... एस. एम. एस. चा फूलफॉर्म  काय आहे?''\n" +
                "\n" +
                "\n" +
                "सरदारजीने पटकन उत्तर दिले , '' सरदार मनमोहन सिंग''\n" +
                "\n" +
                "पब्लीक हसायला लागली. \n" +
                "\n" +
                "आता दुसऱ्या प्रश्नाने सरदारजीला पस्त करण्याचे ठरवून जज ने दुसरा प्रश्न विचारला, '' सरदारजी आता हे सांगा...की \n" +
                "\n" +
                "एम. एम. एस. चा फूलफोर्म  काय आहे? .\"\"\n" +
                "\n" +
                "सरदारजीने गालातल्या गालात हसत उत्तर दिले '' सोपं आहे... मिसेस मनमोहन सिंग''","प्रश्न - उंच भिंतीवर बल्ब फीट करण्यासाठी किती सरदार लागतील? \n" +
                "\n" +
                "उत्तर - दोन, एक शिडीवर चढून बल्ब होल्डरमधे घालण्यासाठी आणि दुसरा शिडी फिरवीण्यासाठी.","सरदार : रात  भर  ट्रेन  में  नींद  hi नाहीं  आई , उपर  का  सीट   मिल  था …\n" +
                "दोस्त : तोच  एक्सचंगे  क्यूँ  नाहीं  किया \n" +
                "सरदार : अरेरे  बेवकूफ , किस्से  करता … नीचे  के  सीट  पे  कोई  भी  नाहीं  था ","सरदार : येऊ  केला  (banana) कैसा  दिया ?\n" +
                "शॉपकिपर :एक  रुपिया .\n" +
                "सरदार : 60 पैसे  का  देता  है ?\n" +
                "स .की : 60 पैसे  में  तो  सिर्फ  चिल्का  मिलेगा .\n" +
                "सरदार : लय  40 पैसा , चिल्का  राख  और  केला  दे  दे ……..","सरदार-Shirt k liye kapda dikhaiye\n" +
                "Salesman-plain me dikhau?\n" +
                "\n" +
                "सरदार-nahi, Helicopter me dikha saale .... Sardar dekha nahi ki mazak shuru..","एक  सरदारजी   ताईंचे  तिकीट   काढायला  जातो  आणि   3 तिकिटे  विकत  घेतो . टिकेट्स  देणारा   विचारतो ,\n" +
                "\n" +
                " \" सरदारजी , तुम्ही  एकटेच  जाणार  मूग  तीन  तिकिटे  कशाला ?\" \n" +
                "\n" +
                "त्यावर  सरदारजी  हसून  म्हणतो ,\n" +
                "\n" +
                "\" अहो, मी  2 तिकिटे  पँट्स  च्या  खिशात  आणि   एक  शर्ट  च्या  खिशात  ठेवतो  म्हणजे   समजा  पँट्स  चा  खिसा  कापला तरी हे उरलेले तिकीट  राहते .\"\n" +
                "\n" +
                " तो  माणूस  परत  विचारतो ,\" आणि  समाज  तुमच्या   शिरताच  खिसा  पण  कापला  तर ?\" त्यावर  आपला  पास  काढून  दाखवत  सरदारंगी  म्हणतो ,\n" +
                "\n" +
                "\" मूग  पास  कशासाठी  असते ???\"","एकदा एका सरदारजीची मोठ्या शहरात  बदली होते. सरदारजी नवीन शहरात आल्यावर जागे साठी खूप हिंडतो. भरपूर शोधल्यावर त्याला एक जागा सापडते. सरदारजीला  ती जागा आवडते. फक्त एक problem असतो आणि तो म्हणजे त्या घराला toilet ची सुविधा नसते. साहजिकच सरदारजीला सकाळी उठल्यावर हातात पाण्याचा डबा घेवून मोकळ्या ठिकाणी जाव लागत.  सरदारजी रोज जिकडे सकाळची क्रिया करायला बसतो तिथे एक झाड असत आणि त्या झाडावर नेहमी एक कावळा  बसलेला असतो. बहुतेक त्या कावळ्याला सरदारजी आवडत नसावा कारण सरदारजी जोर मारायला लागला कि तो कावला नेमका येउन सरदारजी च्या पाण्याच्या डब्याला धडक द्यायचा. सहाजिकच कावळ्याच्या धक्क्याने तो डबा पालथा होऊन त्यातल सर्व पाणी जमिनीवर सांडायच. या सर्व प्रकाराने सरदारजीची पंचाईत व्यायची आणि सरदारजी दुखी होऊन ऑफिस ला यायचा. सरदारजीचा पडलेला चेहरा पहिला कि त्याचा मित्र त्याला मिश्किल पणे विचारायचा \" क्यो सरदारजी आज भी कव्वेने पाणी गिराया? यावर सरदारजी उदास चेहऱ्याने मान हलवायचा.\n" +
                "\n" +
                "एक दिवस सरदारजी  हसरा चेहरा घेवून ऑफिस ला येतो. सरदारजीला प्रथमच हसऱ्या चेहराने आलेला पाहून त्याचा मित्र त्याला विचारतो \"क्यो सरदारजी आज  " +
                "कव्वेने पाणी नही गिराया क्या? त्यावर सरदारजी खूप खुश होऊन उत्तर देत म्हणतो \"कव्वे को गिराने के लिये डब्बे मे पाणी हि नही था? त्याचा मित्र अश्चार्याने त्याला विचारतो\" वो कैसे सरदारजी\". " +
                "यावर सरदारजी उत्तर देतो \" वो इसलिये कि आज मै धोके के बैठ गया\".","एक सिंधी, एक पठान आणि एक सरदारजी एका बेटावर अडकले होते." +
                " सिंध्याने पोहून किनाऱ्यावर जाण्याचा प्रयत्न केला पण जवळजवळ 20 टक्के अंतर पोहून झाल्यावर तो थकला आणि बेटावर पोहत परतला. " +
                "पठानानेही पोहून किनाऱ्यावर जाण्याचा प्रयत्न केला पण जवळजवळ 25 टक्के अंतर पोहून झाल्यावर तो थकून बेटावर परतला. " +
                "आता सरदारजीची पाळी होती. त्यानेही पोहून किनाऱ्यावर जाण्याचा प्रयत्न केला. पण 50 टक्के अंतर पार केल्यावर त्याला बुडण्याची भिती वाटली आणि तो बेटावर परत आला.","तिन सरदार एका लिफ्टमधे होते जेव्हा अचानक ती लिफ्ट बंद पडली, कारण लाईट गेली होती. त्यांनी त्यांचा मोबाईल वापरुन बाहेरुन मदत घेण्याचा प्रयत्न केला, पण तिघांच्याही मोबाईलला रेंज मिळत नव्हती. \n" +
                "\n" +
                "\n" +
                "काही तास असेच लिफ्टमधे घालविल्यानंतर एका सरदाराने सुचवले, '' मला वाटते मदत मिळविण्याचा सगळ्यात चांगला उपाय म्हणजे सगळ्यांनी सोबत ओरडायला पाहिजे''\n" +
                "\n" +
                "बाकिचे दोन जणांनी पहिल्याच्या म्हणण्यावर सहमती दर्शवली. म्हणून सगळ्यांनी एक दिर्घ श्वास घेतला आणि ते ओरडायला लागले, '' सोबत, सोबत, सोबत ''","एका सरदाराने 1 एप्रिलला सीटी बसमधे कंडक्टरकडून 5 रुपयाचे टिकीट विकत घेतले आणि तो कंडक्टरला म्हणाला, '' एप्रिल फुल''\n" +
                "\n" +
                "'' कसे काय?'' कंडक्टरने विचारले.\n" +
                "\n" +
                "'' कारण माझ्याजवळ ऑलरेडी बसचा पास आहे''","सरदार ची बायको त्याचा मित्र बंता सोबत पळून गेली होती तेव्हा त्याच्या एका नातेवाईकाने आपली सहानुभूती व्यक्त केली. \n" +
                "\n" +
                "नातेवाईक - अरेरे खुप वाईट झालं ... तु तिला खुप मीस करीत असशिल नाही? \n" +
                "\n" +
                "सरदार - हो खुप मिस करतो ... पण तिला नाही त्याला ... कारण बंता माझा एकूलता एक चांगला मित्र होता. "
                ,"सरदारजी पोलिस स्टेशनमधे गेला आणि त्याने पोलिस स्टेशनमधे तक्रार नोंदवली -\n" +
                "\n" +
                "सरदारजी - साहेब मला फोनवर धमक्या मिळत आहेत \n" +
                "\n" +
                "पोलिस - कोण आहे तो जो तुम्हाला धमक्या देत आहे? \n" +
                "\n" +
                "सरदारजी - साहेब ... टेलिफोनवाले... म्हणतात बिल नाही भरलं तर कापून टाकीन. ","सरदारला आपला कुत्रा विकायचा होता. आणि बंता त्याला विकत घेणार होता. \n" +
                "\n" +
                "बंता - हा कुत्रा विश्वासू तर आहे ना ?\n" +
                "\n" +
                "सरदार - हो आहेना, मी याला आतापर्यंत तिनदा विकलेले आहे, पण तो एवढा विश्वासू आहे की प्रत्येक वेळी पुन्हा माझ्याजवळच परत येतो. ","सरदार- यार मला 1000 रुपए उधार देतोस का?. \n" +
                "\n" +
                "मित्र - मी तुला 1000 रुपए उधार देऊ शकत नाही ... कारण आपली मैत्री या हजार रुपयापेक्षा कितीतरी जास्त मौल्यवान आहे. \n" +
                "\n" +
                "सरदार - काही हरकत नाही ... तु मला 2000 रुपए उधार दे. ","एक सरदारजी टॅक्सीतून घरुन विमान तळाकडे निघाला होता. पण जाता जाता एका जागी मधेच ड्रायव्हरने टॅक्सी थांबवली.\n" +
                "\n" +
                "सरदारजी - काय झालं?\n" +
                "\n" +
                "ड्रायव्हर - साहेब आता आपण पुढे जावू शकणार नाही ... कारण पेट्रोल संपलं आहे..\n" +
                "\n" +
                "काही हरकत नाही ... मग टॅक्सी मागे घरी परत घे... "
                ,"एका सरदाराला एकदा ब्लॅंक एसएमएस आला. सरदाराने त्या मोबाईल नंबरवर फोन केला , '' अरे दोस्ता तुला माहित आहेका तुझ्या मोबाईलची शाई संपलेली आहे''"
        };






        getSupportActionBar().setDisplayHomeAsUpEnabled(true);



        viewPager = (ViewPager) findViewById(R.id.Pager);
        // Pass results to ViewPagerAdapter Class
        adapter = new ViewPagerAdapter(SardarJokes.this,List);
        // Binds the Adapter to the ViewPager
        viewPager.setAdapter(adapter);

        int pos = getIntent().getIntExtra("key", 0);
        viewPager.setCurrentItem(pos);



    }





    @Override
    public boolean onOptionsItemSelected(MenuItem item) {
        // Handle action bar item clicks here. The action bar will
        // automatically handle clicks on the Home/Up button, so long
        // as you specify a parent activity in AndroidManifest.xml.
        int id = item.getItemId();

        //noinspection SimplifiableIfStatement

        switch (item.getItemId()) {
            case android.R.id.home:

                // app icon in action bar clicked; goto parent activity.
                this.finish();
                return true;
            default:
                if (id == R.id.action_send) {
                    Intent i = new Intent(Intent.ACTION_SEND);
                    i.setType("text/plain");
                    i.putExtra(Intent.EXTRA_TEXT, "message to share");
                    startActivity(Intent.createChooser(i, "Share via"));
                    return true;
                }
                return super.onOptionsItemSelected(item);

        }
    }
}
