package com.geniusnine.android.marathijokes.Stories;

/**
 * Created by Dev on 14-12-2016.
 */

import android.content.Intent;
import android.os.Bundle;
import android.support.v4.view.PagerAdapter;
import android.support.v4.view.ViewPager;
import android.support.v7.app.AppCompatActivity;
import android.view.MenuItem;

import com.geniusnine.android.marathijokes.Best.ViewPagerAdapter;
import com.geniusnine.android.marathijokes.R;


public class StoriesDetail extends AppCompatActivity {

    String[] List;

    ViewPager viewPager;
    PagerAdapter adapter;
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_best_joke);

        List = new String[] {
"एकदा तरूण मूलाचा ग्रुप\n" +
        "दिंडीला निघतो,\n" +
        "गूरूजी कानमंत्र सांगतात ???\n" +
        "रस्त्यात जर सुंदर मुलगी\n" +
        "दिसली तर फक्त\n" +
        " !! हरि ओम !!\n" +
        "म्हणायचं..\n" +
        "म्हणजे लक्ष विचलित\n" +
        "होणार नाही...\n" +
        "थोडे अंतर चालल्यावर एक\n" +
        "जन \n" +
        "!! हरि ओम !!\n" +
        "  म्हणतो...\n" +
        ":\n" +
        "लगेच बाकी सारे एका सूरात\n" +
        "म्हणतात  ???\n" +
        "कुठय  कुठय !!!\n" +
        "कुठय  कुठय ???"
,"मराठी भाषा फारच अजब आहे ना...??\n" +
                " \n" +
                "\n" +
                "...गाडी 'बिघडली' असेल तर म्हणतात 'बंद' आहे.\n" +
                " \n" +
                "\n" +
                "आणि पोरगी बिघडली असेल तर म्हणतात 'चालू' आहे.......","एक शिक्षण अधिकारी\n" +
                "एकदा एका शाळेत गेला\n" +
                "सहजच एका वर्गात शिरला,\n" +
                "एक साथ नमस्ते - सारा वर्ग बोलला.\n" +
                "बसा, मुलांनो बसा - अधिकारी म्हणाला.\n" +
                "\n" +
                "\"रावणाला कोणी मारला ?\" - ऐसा प्रश्न् विचारला\n" +
                "सारा वर्ग शांत शांत जाहला\n" +
                "प्रश्न् पुन्हा एकदा विचारला\n" +
                "\"मी नाही मारला, मी नाही मारला - प्रत्येकजण बोलला\n" +
                "\n" +
                "अधिकारी खूप वैतागला, मास्तरांना म्हणाला -\n" +
                "\"रावणाला कोणी मारला, का येत नाही मुलांना ?\"\n" +
                "मास्तरांनी खुलासा केला -\n" +
                "आमचा विद्यार्थी साधा भोळा\n" +
                "गांधी अहिंसा ठाऊक त्याला\n" +
                "कशाला कोण मारेल रावणाला ?\n" +
                "अधिकारी आणखी वैतागला,\n" +
                "मुख्याध्यापकांकडे गेला,\n" +
                "झाला प्रकार सांगितला,\n" +
                "\"रावणाला कोणी मारला ?\n" +
                "विद्यार्थी सांगत नाहीत\" - म्हणाला \n" +
                "\n" +
                "मुख्याध्यापक म्हणाले -\n" +
                "\"शाळेच्या आवारात मारला, की शाळेच्या बाहेर मारला ?\";\n" +
                "\"जर शाळेच्या आवारात मारला तर बघतो एकेकाला\n" +
                "जर शाळेच्या बाहेर मारला तर आमचा संबंध कसला ?\" ","एके दिवशी काय झाले ?\n" +
                " जखम म्हणाली bandage ला\n" +
                "चल आपण लग्न करून संसारात अटकु ..\n" +
                "जखम म्हणाली bandage ला\n" +
                "चल आपण लग्न करून संसारात अटकु ..\n" +
                "\n" +
                "bandage म्हणाले नको रे बाबा,\n" +
                "तू सुकलीस तर मी कोणाला चिटकू","एकदा संता बंताला स्वत:च्या घरी बोलावतो,\n" +
                "जेव्हा संता बंताच्या घरी जातो तेव्हा, बंताच्या घराला टाळे लावलेले असते आणि\n" +
                "तिथे लिहुन ठेवलेले असते “तुझा पोपट झालाय, चल फूट इथून”\n" +
                "संता खाली पडलेला खडु उचलतो आणि लिहितो\n" +
                "“मी आलोच नव्हतो”","झंप्या: ए पंप्या, एवढा घाबराघुबरा का झालायस बुवा तू?\n" +
                "पंप्या: अरे, थोडं कन्फ्युजन झालं यार.\n" +
                "झंप्या: म्हणजे?\n" +
                "पंप्या: अरे मी रस्त्यावरून चाललो असताना मला समोर काहीतरी दिसलं. मला वाटलं की साप आहे. पण नेमकी ती काठी होती.\n" +
                "झंप्या: हात्तिच्या... एवढंच ना.\n" +
                "पंप्या: हो रे... पण मग त्या सापाला मारण्यासाठी म्हणून मी जी काठी उचलली ना, तो खरा साप निघाला.","कावळा: चिऊताई, चिऊताई, दार उघड!\n" +
                "चिमणी: थांब माझ्या बाळाला पावडर लावते...\n" +
                "कावळा: माझ्या सोबत माझी मुलगी पण आहे...\n" +
                "बाळ: आई, पावडर मी लावतो, तू पहिले दार उघड!","‘मित्राकडे गेलो होतो गं!’ उशीरा घरी आलेला गंपू बायकोला कारण सांगतो.\n" +
                "खरं-खोटं तपासण्यासाठी बायको त्याच्या दहा मित्रांना फोन करते.\n" +
                "दहा पैकी पाच जण सांगतात, ‘हो, आलेला ना इथे!’\n" +
                "तिघे सांगतात, ‘हा काय, आत्ताच गेला...’\n" +
                "उरलेले दोघे म्हणतात, ‘अहो वहिनी, हा काय इथेच आहे! देऊ का त्याच्याकडे फोन?’","रामू: ए राजू, तुला मी एका सेकंदात अख्खे गाणे म्हणून दाखवू?\n" +
                "राजू: शक्यच नाही, चल म्हणून दाखव पाहू\n" +
                "रामू: गाऽऽणे!\n" +
                "राजू: अरे वा! चल, मीसुद्धा तुला फटाका न फोडता अगदी तुझ्या दोन्ही कानांजवळ फटाक्याचा मोठा आवाज काढून दाखवतो\n" +
                "रामू: दाखव की... त्याचे बोलणे पूर्ण होण्याआधीच राजू त्याच्या कानांखाली पेटवतो\n" +
                "फाऽऽट फाऽऽट...","पुण्यातल्या मुलींना बर्थ डे गिफ्ट काय द्याल?\n" +
                ".\n" +
                ".\n" +
                ".\n" +
                "एक डझन स्कार्फ...!","(संता मित्राच्या पार्टी मध्ये ड्रिंक घेत उभा होता, एवढ्यात त्याच लक्ष एका सुंदर मुलीकडे गेलं)\n" +
                "संता: तू माझ्या बरोबर डान्स करशील का?\n" +
                "मुलगी (तुच्छतेने): मै बच्चे के साथ डान्स नही करती...\n" +
                "संता: ओ\u200Dह... माफ कर हा, मला माहित नव्हतं तू प्रेग्नन्ट आहेस","आज बॅंकेचा कॅशियर बेशुध्द होता होता राहिला...\n" +
                "जेव्हा ४ - ५ तास लाईनमध्ये उभे राहून एक बाई दोन हजाराची नोट बघून म्हणाली\n" +
                "“भाऊ, याच्यात अजून कलर्स दाखवा ना”.","मुलाचा निबंध\n" +
                "\n" +
                "…….आवडता पक्षी–बदक !!…...\n" +
                "\n" +
                "बदक मला आवडते!!..बदक पाण्यात असते !!..मी पण पाणी पितो!!\n" +
                "आमच्या बाजूचे बबन काका दारू पितात!!.\n" +
                ".दारू वाईट असते असे गांधीजी सांगत!!..गांधीजी मोट्ठे नेते होते!!..\n" +
                "पण त्यांच्या हातात काठी पण असते!!..\n" +
                "काठी पाण्यावर तरंगते..व बदक सुद्धा तरंगते!!..बदक जास्त उड़त नाही..पण पोहते..मी पण swimming ला जाणार आहे!!.\n" +
                "बदक वाकड्या पायाने चालते..आमच्या building मधल्या सुलेखाला आम्ही बदक म्हणतो! \n" +
                "\n" +
                "(सुलेखाताइने मला काठीने मारले!!)..बदक काठीने मारत नाही!!..\n" +
                "गांधीजी काठी वापरत;म्हणुन आपला देश लवकर स्वतंत्र झाला…\n" +
                "आमच्या घरी कपडे वाळत घालायला काठी वापरतात!!..\n" +
                "(आमची आज्जी कुत्र्यांना घबरवायला काठी वापरते!!)..\n" +
                "आमच्या घरात चिमण्या व कबुतरे येतात…\n" +
                "खिडकीपाशी कावले पण येतात..!!पण बदक येत नाही!!..\n" +
                "कारण ते उंच उडू शकत नाही!!..(आम्ही १ st floor ला राहतो)…\n" +
                "पण बदक पाण्यात रोज आंघोळ करते!! ..मी पण आंघोळ करतो..कारण आई ओरडत असते!!..पण मी पाच मिनीटात आंघोळ करतो!!\n" +
                "बदक रोज आंघोळ करते म्हणुन ते गोरे असते …(पण काले बदक सुद्धा असते …\n" +
                "ते बहुतेक आंघोळ करत नाही!!)…\n" +
                "मला बदक खुप आवडते!!","एक माणूस दुसर्या शहरात\n" +
                "नौकरीसाठी जातो,\n" +
                "तिथे पोहचल्यावर त्याने विचार\n" +
                "केला की ,बायकोला इमेल\n" +
                "करावा म्हणून.\n" +
                "चुकून तो इमेल दुसरीकडे जातो.\n" +
                "\n" +
                "ज्याच्याकडे गेला ती स्त्री आपल्या\n" +
                "नवर्याचा अंत्यविधी करून\n" +
                "घरी आलेली असते ,\n" +
                "तो इमेल पाहून बेशुध्द पडते .\n" +
                "इमेल असा होता :\n" +
                "प्रिय पत्नी ,मी इथे\n" +
                "व्यवस्थित पोहचलो, इथे\n" +
                "इंटरनेट ची व्यवस्था आहे.\n" +
                "तू नाराज होऊ नको,२-३ दिवसात\n" +
                "मी तुला माझ्याकडे बोलावून\n" +
                "घेईन","टोपीवाल्याची गोष्ट आठवते\n" +
                "का लहानपणीची???\n" +
                "आता त्याचा रिमेक ऐका...\n" +
                "एक टोपीवाला गावातून जात असतो, तो दमतो,\n" +
                "म्हणून\n" +
                "झाडाखाली विश्रांती घेतो...\n" +
                "उठून पाहतो तर\n" +
                "झाडावरच्या माकडांनी त्याच्या टोप्या पळवल्या असतात...\n" +
                "त्याला आजोबांची गोष्ट आठवते...\n" +
                "तो स्वताकडची दुसरी टोपी जमिनीवर रागाने\n" +
                "आपटतो...\n" +
                "पण यावेळी झाडावरची माकड त्याच अनुकरण\n" +
                "करत नाहीत....\n" +
                "उलट १ माकड दात दाखवून बोलतो,\n" +
                "\"काय रे शहाण्या, आजोबा काय फक्त तुलाच होते\n" +
                "का???\" :\n" +
                " Logged\n","नवरा: हॅलो मिसेस बायको, मला तुझी मुलाखत घ्यायची आहे...\n" +
                "बायको: आता नको, मला सिरिअल्स बघायच्या आहेत\n" +
                "नवरा: थोड्या वेळाने लाईट जाणार आहे, डायरेक्ट संध्याकाळीच येणार आहे. पेपर-बिपर वाचतेस की नाही?\n" +
                "बायको: नाही वाचत. काय असतंय त्यात वाचण्यासारखं? बाय द वे, तुम्ही कोणत्या पेपरचे पत्रकार? पुढारी?\n" +
                "नवरा: नाही, तरुण इंडिया\n" +
                "बायको: बरं, विचारा तुमचे प्रश्न...\n" +
                "नवरा: तू माझ्याशी लग्न केले ते तुला घरच्यांनी सांगितले म्हणून की तुला मी आवडलो म्हणून?\n" +
                "बायको: छे... तुमच्यात काय आहे मला आवडण्यासारखं? आई म्हणाली मुलगा बावळट दिसतोय, तू सांगेल ते ऐकेल, पसंत कर, म्हणून मी पसंत केलं तुम्हाला.\n" +
                "नवरा: अच्छा... म्हणजे तुझी आई आहे तर ही म्हैस माझ्या गळ्यात घालण्यामागे.\n" +
                "बायको: माइंड युवर लॅन्ग्वेज मिस्टर बैलोबा, माझ्या आईला कांही म्हणायचं नाही.\n" +
                "नवरा: सॉरी, म्हशीचा अपमान करायचा नव्हता मला.\n" +
                "बायको: नेक्स्ट क्वेश्चन प्लीज.\n" +
                "नवरा: माझ्यापेक्षा दुसरा एखादा चांगला चॉइस मिळाला असता तर काय केले असतेस?\n" +
                "बायको: अहो, तुमच्यापेक्षा जास्त बावळट कोण मिळाला असता मला?\n" +
                "नवरा: लग्नात तुला तुझ्या बापानं भरपूर कांही दिलं, पण मला फारसं कांही दिलं नाही. असे का?\n" +
                "बायको: तुम्हाला आशीर्वाद दिले की भरपूर....\n" +
                "नवरा: तू कोल्हापूरची तर मी पुण्याचा. या दोन्ही शहराच्या संस्कृतीत तुला काय फरक वाटतो?\n" +
                "बायको: कोल्हापूर ते कोल्हापूर... त्याची सर कधी पुण्याला येणार आहे का? कोल्हापुरी मिसळ आणि पुणेरी मिसळ यांची तुलना केली तरी कळतंय हे. कोल्हापुरी फेटा आणि पुणेरी पगडीचंच बघा... कोल्हापुरी फेटा किती रुबाबदार........"
                ,"एका गृहस्थाला सपाटून भूक लागली , म्हणून तो हॉटेल शोधत होता.तेवढ्यात त्याला पाटी दिसली.\n" +
                "\n" +
                "त्यावर लिहिलं होतं , ' जेवणाची उत्तमसोय '\n" +
                "जवळ गेल्यावर त्याला दोन हॉल दिसले .\n" +
                "एकावर लिहिलं होतं ' शाकाहारी '\n" +
                "तर दुसर्याववर ' मांसाहारी '\n" +
                "तो मांसाहारी हॉलमध्ये शिरला.\n" +
                "\n" +
                "आतमध्ये आणखी दोन हॉल होते.\n" +
                "डावीकडे पाटी होती , ' भारतीय बैठक '\n" +
                "तर उजवीकडे , ' डायनिंग टेबल '\n" +
                "तो टेबलच्या हॉलमध्ये शिरला.\n" +
                "\n" +
                "आतमध्ये पुन्हा दोन हॉल होते.एकावर पाटी होती 'रोख' तर दुसर्याावर 'उधार'\n" +
                "तो फुकट्या असल्याने अर्थातच उधारीच्या हॉलमध्ये शिरला.\n" +
                "\n" +
                "वाहनांची वर्दळ त्याला समोर दिसली. तोअचंबीत झाला . त्याने मागे वळून पाहिले एक पाटी होतीच त्याला खिजवायला ,\n" +
                "'फुकट्या , मागे वळून काय बघतोस ? हा रस्ताच आहे. हॉटेल नाही.","मुलीच्या नजरेतून:- ती पहिल्या बेंचवरुन\n" +
                "वळुन बघते\n" +
                "अणि मनातल्या मनात बोलते,\n" +
                "\"thank God!! .. आलाय आज.\"\n" +
                ".\n" +
                ".\n" +
                ".\n" +
                "मुलांच्या नजरेतून:- मुलाने त्याच्या GF\n" +
                "ला पाहण्याआधीच पूर्ण\n" +
                "क्लास एका सुरात ओरडतो..\n" +
                "\"वहिनी आली रे...","एकदा एका शाळे मध्ये गणिताचे मास्तर आणि इतिहासाचे मास्तर यांचे काही करणा मुळे भांडण होते.\n" +
                "\n" +
                "इतिहासाचे मास्तर म्हणतात मी तुज्या अंगावर औरंगजेबाचे सैन्य घालीन .\n" +
                "\n" +
                "तर गणिताचे मास्तर म्हणतात की मी तुला आणि त्या औरंगजेबाच्या सैन्याला कंसा मध्ये टाकून शून्याने गुणाकार करेन .","एक भुर्टा चोर आपल्या खिसेकापू मित्राला म्हणाला .आज एक बाई दार उघड टाकुन शेजरनी कड़े गेली असताना\n" +
                "मी घरात शिरलो आणि माल घेवुन बाहेर पडत असताना ती बाई दारात हजर .\n" +
                "'मग काय मार खावा लागला का ?'मित्राने विचारले\n" +
                "'छे छे ,दूध ज्लाल्याचा वास आला म्हणून ग्यास बंद करायला आत शिरलो,'अशी सबब सांगताच ती बाई आत पलाली आणि मी बाहेर.","एक वयोवृद्ध फ्रेंच गृहस्थ क्षमायाचनेसाठी चर्चमध्ये गेले. अत्यंत नम्र स्वरात ते धर्मगुरूला म्हणाला, ‘‘माझ्याकडून घडलेल्या पापाबद्दल मला क्षमा असावी, दुसऱ्या महायुद्धाच्या काळात एका मध्यरात्रीच्या सुमारास एका सुंदर स्त्रीनं माझ्या घराचा दरवाजा ठोठावला. तिला आत घेतल्यानंतर तिनं स्वत:ला शत्रूपासून वाचविण्याची मला विनंती केली. दया येऊन मी तिला माझ्या घरातील माळ्यावर लपविलं.’’\n" +
                "‘मित्रा,  यात  क्षमा मागण्यासारखं तुझ्याकडून काहीच घडलेलं नाही.’ धर्मगुरू, म्हणाले, ‘‘उलट आसऱ्यासाठी आलेल्या एका असहाय अबलेला आश्रय देऊन तू एक महान कार्यच केलंस.’’\n" +
                "‘होय,’ गृहस्थ म्हणाले, ‘‘परंतु कृतक्षतेच्या पोटी म्हणा किंवा आणखी दुसऱ्या कुठल्या कारणानं म्हणा, तिनं मला अनेकदा शरीरसुख दिलं आणि मी पण तिला भरपूर प्रतिसाद दिला.’’\n" +
                "‘युद्धकाळात अशा गमतीशीर घटना घडतातच,’ धर्मगुरू म्हणाले, ‘‘तुम्हाला तुमच्या कृत्याचा खरोखरच पश्चात्ताप होत असेल तर तुम्ही क्षमेला पात्र आहात.’’\n" +
                "‘माझ्या मनावरचं मोठंच ओझं दूर झालं,’ गृहस्थ म्हणाले, ‘एक प्रश्न विचारू का?’\n" +
                "‘अवश्य’, धर्मगुरू म्हणाले.\n" +
                "‘‘माळ्यावरच्या जागेला ती आता चांगलीच सरावली आहे, तरीही युद्ध संपल्याचं तिला सांगणं आवश्यक आहे का?"
        };






        getSupportActionBar().setDisplayHomeAsUpEnabled(true);



        viewPager = (ViewPager) findViewById(R.id.Pager);
        // Pass results to ViewPagerAdapter Class
        adapter = new ViewPagerAdapter(StoriesDetail.this,List);
        // Binds the Adapter to the ViewPager
        viewPager.setAdapter(adapter);

        int pos = getIntent().getIntExtra("key", 0);
        viewPager.setCurrentItem(pos);



    }




    @Override
    public boolean onOptionsItemSelected(MenuItem item) {
        // Handle action bar item clicks here. The action bar will
        // automatically handle clicks on the Home/Up button, so long
        // as you specify a parent activity in AndroidManifest.xml.
        int id = item.getItemId();

        //noinspection SimplifiableIfStatement

        switch (item.getItemId()) {
            case android.R.id.home:

                // app icon in action bar clicked; goto parent activity.
                this.finish();
                return true;
            default:
                if (id == R.id.action_send) {
                    Intent i = new Intent(Intent.ACTION_SEND);
                    i.setType("text/plain");
                    i.putExtra(Intent.EXTRA_TEXT, "message to share");
                    startActivity(Intent.createChooser(i, "Share via"));
                    return true;
                }
                return super.onOptionsItemSelected(item);

        }
    }
}
